[
    {
        "Headline": "IPL 2023: Tension rises in the middle as Virat Kohli refuses to shake hands with Sourav Ganguly - WATCH VIDEO - WION",
        "Url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy53aW9uZXdzLmNvbS9zcG9ydHMvaXBsLTIwMjMtdGVuc2lvbi1yaXNlcy1pbi10aGUtbWlkZGxlLWFzLXZpcmF0LWtvaGxpLXJlZnVzZXMtdG8tc2hha2UtaGFuZHMtd2l0aC1zb3VyYXYtZ2FuZ3VseS13YXRjaC12aWRlby01ODI4MjbSAZQBaHR0cHM6Ly93d3cud2lvbmV3cy5jb20vc3BvcnRzL2lwbC0yMDIzLXRlbnNpb24tcmlzZXMtaW4tdGhlLW1pZGRsZS1hcy12aXJhdC1rb2hsaS1yZWZ1c2VzLXRvLXNoYWtlLWhhbmRzLXdpdGgtc291cmF2LWdhbmd1bHktd2F0Y2gtdmlkZW8tNTgyODI2L2FtcA?oc=5&hl=en-US&gl=US&ceid=US:en",
        "Article": "In a shocking turn of events, two of the biggest names in Indian cricket – Virat Kohli and Sourav Ganguly didn’t shake hands after RCB vs DC match in Bengaluru on Saturday. In a video clip that has gone viral on social media, Kohli jumped the queue and didn’t shake with Ganguly, with whom he doesn’t believe to share a great history. Moreover, Delhi Capitals head coach Ricky Ponting was also seen having a word with Kohli after he avoided shaking hands with DC’s director of cricket.\n\nWatch the video here -\n\nVirat kohli Ignore Ganguly not even handshake .its call karma ganguly never mess with king kohli👍👍👍 pic.twitter.com/IeHjmvI32S — Radhe krishna🇮🇳 (@king_Virat140) April 15, 2023 ×\n\nVirat starred in RCB’s 23-run win over Delhi Capitals, hitting his third fifty of the season in the game. Even during the match, both seemed to share cold vibes and didn’t see each other eye to eye.\n\nRecently, Chetan Sharma, BCCI’s former chief selector, on a string operation done on him, revealed that ex-BCCI President Ganguly did play a little role in deciding Virat Kohli’s fate as the Indian captain across formats during his tenure. Besides, he also admitted that Ganguly alongside him didn’t like Kohli.\n\nNot only this, but Chetan also revealed that Kohli was informed beforehand about his removal as the captain, and that the former number one batter lied to the media when asked about the same upon him landing in South Africa for the bilateral series in 2021/2022.\n\nAfter the news broke out, there was a strange wave in Indian cricket that saw things getting ugly at all levels. With the team then scheduled to play bilateral series against Australia, everything went under the mat.\n\nHowever, after what transpired at the M Chinnaswamy Stadium on Saturday, the venue where Virat created history, it doesn’t look like all is well between two giant figures of Indian cricket.",
        "summary": "In a shocking turn of events, two of the biggest names in Indian cricket – Virat Kohli and Sourav Ganguly didn’t shake hands after RCB vs DC match in Bengaluru on Saturday.\nIn a video clip that has gone viral on social media, Kohli jumped the queue and didn’t shake with Ganguly, with whom he doesn’t believe to share a great history.\nWatch the video here -Virat kohli Ignore Ganguly not even handshake .its call karma ganguly never mess with king kohli👍👍👍 pic.twitter.com/IeHjmvI32S — Radhe krishna🇮🇳 (@king_Virat140) April 15, 2023 ×Virat starred in RCB’s 23-run win over Delhi Capitals, hitting his third fifty of the season in the game.\nAfter the news broke out, there was a strange wave in Indian cricket that saw things getting ugly at all levels.\nHowever, after what transpired at the M Chinnaswamy Stadium on Saturday, the venue where Virat created history, it doesn’t look like all is well between two giant figures of Indian cricket.",
        "Sentiment": "negative",
        "images": "http://cdn.wionews.com/sites/default/files/2023/04/15/345587-untitled-design-2023-04-15t212601625.jpg",
        "Publish date": "None",
        "Keywords": [
            "shake",
            "kohli",
            "video",
            "middle",
            "tension",
            "sourav",
            "virat",
            "indian",
            "refuses",
            "series",
            "rises",
            "share",
            "watch",
            "ganguly",
            "cricket",
            "didnt"
        ],
        "TextClassification": "Sports",
        "id": 1
    },
    {
        "Headline": "Virat Kohli REACTS to wife Anushka Sharma's latest Instagram photo - Indiatimes.com",
        "Url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9lbnRlcnRhaW5tZW50L2hpbmRpL2JvbGx5d29vZC9uZXdzL3ZpcmF0LWtvaGxpLXJlYWN0cy10by13aWZlLWFudXNoa2Etc2hhcm1hcy1sYXRlc3QtaW5zdGFncmFtLXBob3RvL2FydGljbGVzaG93Lzk5NTA4ODcyLmNtc9IBnAFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9lbnRlcnRhaW5tZW50L2hpbmRpL2JvbGx5d29vZC9uZXdzL3ZpcmF0LWtvaGxpLXJlYWN0cy10by13aWZlLWFudXNoa2Etc2hhcm1hcy1sYXRlc3QtaW5zdGFncmFtLXBob3RvL2FtcF9hcnRpY2xlc2hvdy85OTUwODg3Mi5jbXM?oc=5&hl=en-US&gl=US&ceid=US:en",
        "Article": "Suhana Khan gives us summer fashion inspiration with her casual yet chic looks",
        "summary": "Suhana Khan gives us summer fashion inspiration with her casual yet chic looks",
        "Sentiment": "negative",
        "images": "https://static.toiimg.com/thumb/msid-99508872,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-39064/99508872.jpg",
        "Publish date": "None",
        "Keywords": [
            "kohli",
            "summer",
            "anushka",
            "chic",
            "fashion",
            "looks",
            "casual",
            "khan",
            "reacts",
            "wife",
            "virat",
            "suhana",
            "sharmas",
            "instagram",
            "gives",
            "inspiration",
            "latest"
        ],
        "TextClassification": "Sports",
        "id": 2
    },
    {
        "Headline": "Virat Kohli is all hearts for his 'queen' Anushka Sharma as she drops a stunning picture donning black athleisure; here's how the internet reacted - Indiatimes.com",
        "Url": "https://news.google.com/rss/articles/CBMi2wFodHRwczovL20udGltZXNvZmluZGlhLmNvbS92aWRlb3MvZW50ZXJ0YWlubWVudC9oaW5kaS92aXJhdC1rb2hsaS1pcy1hbGwtaGVhcnRzLWZvci1oaXMtcXVlZW4tYW51c2hrYS1zaGFybWEtYXMtc2hlLWRyb3BzLWEtc3R1bm5pbmctcGljdHVyZS1kb25uaW5nLWJsYWNrLWF0aGxlaXN1cmUtaGVyZXMtaG93LXRoZS1pbnRlcm5ldC1yZWFjdGVkL3ZpZGVvc2hvdy85OTUxNzcyNy5jbXPSAd8BaHR0cHM6Ly9tLnRpbWVzb2ZpbmRpYS5jb20vdmlkZW9zL2VudGVydGFpbm1lbnQvaGluZGkvdmlyYXQta29obGktaXMtYWxsLWhlYXJ0cy1mb3ItaGlzLXF1ZWVuLWFudXNoa2Etc2hhcm1hLWFzLXNoZS1kcm9wcy1hLXN0dW5uaW5nLXBpY3R1cmUtZG9ubmluZy1ibGFjay1hdGhsZWlzdXJlLWhlcmVzLWhvdy10aGUtaW50ZXJuZXQtcmVhY3RlZC9hbXBfdmlkZW9zaG93Lzk5NTE3NzI3LmNtcw?oc=5&hl=en-US&gl=US&ceid=US:en",
        "Article": "B-town's power couple Anushka Sharma and Virat Kohli often shell out relationship goals among fans on social media. The actress recently treated her followers on Instagram with a chic photo of herself. In the snap, the film 'Zero' actress can be seen posing for the lens wearing black athleisure and a jacket. Soon after coming across this picture, her cricketer-husband Virat Kohli, who could not stop gushing over his wife's stunning look, took to the comment section and dropped a fire and red heart emoticon. Apart from him, Anushka's fans also showered love upon her and penned comments like 'And the queen is here', another wrote, 'So Beautiful.' For more news and updates, stay tuned to ETimes.",
        "summary": "B-town's power couple Anushka Sharma and Virat Kohli often shell out relationship goals among fans on social media.\nIn the snap, the film 'Zero' actress can be seen posing for the lens wearing black athleisure and a jacket.\nSoon after coming across this picture, her cricketer-husband Virat Kohli, who could not stop gushing over his wife's stunning look, took to the comment section and dropped a fire and red heart emoticon.\nApart from him, Anushka's fans also showered love upon her and penned comments like 'And the queen is here', another wrote, 'So Beautiful.'\nFor more news and updates, stay tuned to ETimes.",
        "Sentiment": "Positive",
        "images": "https://timesofindia.indiatimes.com/photo/99517727/size-57578/99517727.jpg",
        "Publish date": "None",
        "Keywords": [
            "wearing",
            "stunning",
            "queen",
            "kohli",
            "hearts",
            "wifes",
            "zero",
            "fans",
            "sharma",
            "virat",
            "reacted",
            "picture",
            "heres",
            "wrote",
            "updates",
            "internet",
            "actress",
            "tuned"
        ],
        "TextClassification": "Sports",
        "id": 3
    },
    {
        "Headline": "On Anushka Sharma's Pic, Virat Kohli Left This Comment - NDTV.com",
        "Url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3Lm5kdHYuY29tL2VudGVydGFpbm1lbnQvb24tYW51c2hrYS1zaGFybWEtcy1pbnN0YS1waWMtdmlyYXQta29obGktcy1jb21tZW50LXNjcmVhbXMtZG90aW5nLWh1c2JhbmQtMzk0ODM3M9IBe2h0dHBzOi8vd3d3Lm5kdHYuY29tL2VudGVydGFpbm1lbnQvb24tYW51c2hrYS1zaGFybWEtcy1pbnN0YS1waWMtdmlyYXQta29obGktcy1jb21tZW50LXNjcmVhbXMtZG90aW5nLWh1c2JhbmQtMzk0ODM3My9hbXAvMQ?oc=5&hl=en-US&gl=US&ceid=US:en",
        "Article": "Anushka Sharma shared this image. (courtesy: anushkasharma)\n\nWhen Bollywood star Anushka Sharma drops a photo, the world stops to stand and stare. Among her legion of fans is her husband and Indian cricket icon Virat Kohli who often shares words of praise under the Ae Dil Hai Mushkil star's Instagram posts. A case in point is her latest post – a stunning selfie of the actress dressed in athleisure. Sharing the image, Anushka Sharma kept the caption simple with just two eyeball emojis. Virat Kohli – being the perfect doting husband – in response to the post, commented with fire and heart emojis. Fans of the actress also shared several compliments under the post.\n\nVirat Kohli recently shared an adorable picture with his 2-year-old daughter Vamika. The picture was taken during their pool time together and features the father-daughter duo looking super cute. Virat added a heart emoji as a caption, keeping it simple and sweet.\n\nVirat Kohli recently shared an incredibly cute picture on Instagram featuring himself and Anushka Sharma. The photo was taken during the Dior pre-fall fashion show in Mumbai, which took place recently. In the picture, the couple is seen walking hand-in-hand, with huge smiles on their faces. Anushka looks stunning in a lemon-yellow dress, while Virat looks as dapper as ever in a finely tailored suit. Virat kept the caption simple, adding infinite and red heart emojis to express his love for his wife.\n\nOn the same occasion, Virat Kohli posted a series of pictures clicked ahead of the Dior pre-fall show. Along with the photos, the former Indian skipper wrote, “About last night” and added a red heart emoji to it.\n\nAnushka Sharma and Virat Kohli got married in 2017 in a private ceremony in Italy after dating for several years. Their daughter Vamika was born in January 2021. On the work front, Anushka will be next seen in Chakda Xpress. The Netflix film, directed by Prosit Roy, is based on the life of cricketer Jhulan Goswami.",
        "summary": "Virat Kohli – being the perfect doting husband – in response to the post, commented with fire and heart emojis.\nVirat Kohli recently shared an adorable picture with his 2-year-old daughter Vamika.\nVirat Kohli recently shared an incredibly cute picture on Instagram featuring himself and Anushka Sharma.\nOn the same occasion, Virat Kohli posted a series of pictures clicked ahead of the Dior pre-fall show.\nAnushka Sharma and Virat Kohli got married in 2017 in a private ceremony in Italy after dating for several years.",
        "Sentiment": "Positive",
        "images": "https://c.ndtvimg.com/2023-04/2pfttof_anushka-_625x300_14_April_23.jpg",
        "Publish date": "None",
        "Keywords": [
            "kohli",
            "anushka",
            "comment",
            "pic",
            "recently",
            "sharma",
            "virat",
            "heart",
            "picture",
            "shared",
            "sharmas",
            "left",
            "emojis",
            "simple"
        ],
        "TextClassification": "Sports",
        "id": 4
    },
    {
        "Headline": "Virat Kohli’s Dance On Cricket Field With ‘Maar Daala’ BGM From Devdas Goes Viral, KRK Declares “I Offer Him An Item Number In Deshdrohi 2” – Video With Make You ROFL! - Koimoi",
        "Url": "https://news.google.com/rss/articles/CBMixAFodHRwczovL3d3dy5rb2ltb2kuY29tL2JvbGx5d29vZC1uZXdzL3ZpcmF0LWtvaGxpLWRhbmNlLW9uLWNyaWNrZXQtZmllbGQtd2l0aC1tYWFyLWRhYWxhLWJnbS1mcm9tLWRldmRhcy1nb2VzLXZpcmFsLWtyay1kZWNsYXJlcy1pLW9mZmVyLWhpbS1hbi1pdGVtLW51bWJlci1pbi1kZXNoZHJvaGktMi12aWRlby13aXRoLW1ha2UteW91LXJvZmwv0gHIAWh0dHBzOi8vd3d3LmtvaW1vaS5jb20vYm9sbHl3b29kLW5ld3MvdmlyYXQta29obGktZGFuY2Utb24tY3JpY2tldC1maWVsZC13aXRoLW1hYXItZGFhbGEtYmdtLWZyb20tZGV2ZGFzLWdvZXMtdmlyYWwta3JrLWRlY2xhcmVzLWktb2ZmZXItaGltLWFuLWl0ZW0tbnVtYmVyLWluLWRlc2hkcm9oaS0yLXZpZGVvLXdpdGgtbWFrZS15b3Utcm9mbC9hbXAv?oc=5&hl=en-US&gl=US&ceid=US:en",
        "Article": "Kamaal R Khan has several legal cases filed against him, but that does not stop him from messing with the leading names of Bollywood. Salman Khan has filed a defamation suit against him and previously KRK was sent to jail over his ill words for late actors Rishi Kapoor and Irrfan Khan. He’s now shared a video of Virat Kohli from the cricket stadium and let’s just confess it, it’s making us ROFL. Scroll below for more details.\n\nEveryone following Kamaal knows he has different targets on different days. He’s been after Varun Dhawan and mocking the announcement of Bhediya sequel since the first part didn’t impress the audiences. A while ago, he also mocked Vicky Kaushal, Ranveer Singh and Ajay Devgn, saying they can never be Bollywood superstars because they look more like South heroes.\n\nAdvertisement\n\nAdvertisement\n\nKRK has shared a viral video clip of Virat Kohli working out on the cricket field in a hilarious way. The former captain can be seen in a goofy mood as he rolls on the ground and leaves the viewers in splits. Adding to the humour, Kamaal has featured his clip with the background music of ‘Maar Daala’ from Devdas.\n\nKRK captioned his post, “I am very impressed by @imVkohli (Virat Kohli) dance skills, hence I offer him an item number in my film #Deshdrohi2!”\n\nTake a look at the viral video below:\n\nI am very impressed by @imVkohli dance skills, hence I offer him an item number in my film #Deshdrohi2! 🤪🤪😁 pic.twitter.com/E51wZD8m3i — KRK (@kamaalrkhan) April 14, 2023\n\nWe’d be lying if we didn’t confess this video of Virat Kohli is hilarious AF!\n\nMeanwhile, Virat Kohli has been in the news over his spiritual visits with wife and actress Anushka Sharma. His old remark “do I look like the pooja path types?” went viral on several occasions with netizens trolling him!\n\nStay tuned to Koimoi for more Bollywood updates.\n\nMust Read: Anushka Sharma “Cried Like A Child” After She Lost The Debut Award To Ghajini Actress Asin Thottumkal: “Mai Calculate Karke Gayi Thi… Obviously Usko Nahi Denge” – Watch\n\nFollow Us: Facebook | Instagram | Twitter | Youtube | Google News",
        "summary": "He’s now shared a video of Virat Kohli from the cricket stadium and let’s just confess it, it’s making us ROFL.\nAdvertisementAdvertisementKRK has shared a viral video clip of Virat Kohli working out on the cricket field in a hilarious way.\nAdding to the humour, Kamaal has featured his clip with the background music of ‘Maar Daala’ from Devdas.\n🤪🤪😁 pic.twitter.com/E51wZD8m3i — KRK (@kamaalrkhan) April 14, 2023We’d be lying if we didn’t confess this video of Virat Kohli is hilarious AF!\nMeanwhile, Virat Kohli has been in the news over his spiritual visits with wife and actress Anushka Sharma.",
        "Sentiment": "Positive",
        "images": "https://static-koimoi.akamaized.net/wp-content/new-galleries/2023/04/virat-kohlis-dance-on-cricket-field-with-maar-daala-bgm-from-devdas-goes-viral-krk-declares-i-offer-him-an-item-number-in-deshdrohi-2-01.jpg",
        "Publish date": "2023-04-15 09:36:53+00:00",
        "Keywords": [
            "kamaal",
            "krk",
            "offer",
            "viral",
            "video",
            "rofl",
            "kohli",
            "bollywood",
            "look",
            "maar",
            "khan",
            "sharma",
            "virat",
            "skills",
            "number",
            "item",
            "kohlis"
        ],
        "TextClassification": "Sports",
        "id": 5
    },
    {
        "Headline": "‘Many predict Gill is next best batter after Kohli. When I see him…’: Ramiz Raja - Hindustan Times",
        "Url": "https://news.google.com/rss/articles/CBMiuQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9tYW55LXByZWRpY3Qtc2h1Ym1hbi1naWxsLWlzLW5leHQtYmVzdC1iYXRzbWFuLWFmdGVyLXZpcmF0LWtvaGxpLXdoZW4taS1zZWUtaGltLXJhbWl6LXJhamEtcy1lbm9ybW91cy10aW1lLWhhcy1zdG9wcGVkLXJlbWFyay0xMDE2ODE0NzUwMTA1NDMuaHRtbNIBvQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vY3JpY2tldC9tYW55LXByZWRpY3Qtc2h1Ym1hbi1naWxsLWlzLW5leHQtYmVzdC1iYXRzbWFuLWFmdGVyLXZpcmF0LWtvaGxpLXdoZW4taS1zZWUtaGltLXJhbWl6LXJhamEtcy1lbm9ybW91cy10aW1lLWhhcy1zdG9wcGVkLXJlbWFyay0xMDE2ODE0NzUwMTA1NDMtYW1wLmh0bWw?oc=5&hl=en-US&gl=US&ceid=US:en",
        "Article": "The Gujarat Titans secured a close win against Punjab Kings on Thursday night, securing their third win of the 2023 Indian Premier League season. Chasing a 154-run target, the Titans did face some hiccups towards the closing stages of the game but Rahul Tewatia secured a win for the side, hitting a four when Titans needed as many to win from the last two deliveries. Their opener Shubman Gill was the star for GT with the bat, as he scored an important 67 off 49 deliveries, smashing seven fours and a six. Virat Kohli; Ramiz Raja; Shubman Gill(PTI/YouTube)\n\nGill held one end as wickets continued to fall on the other, and maintained the pace of run-scoring as Sai Sudharsan (19 off 20 balls), Hardik Pandya (8 off 11 balls), and David Miller (17* off 18 balls) all struggled to hit big throughout their innings.\n\nAlso read: 'There are faults in system': Kaif blasts Laxman-led NCA over no clarity on Bumrah injury\n\nFormer Pakistan captain Ramiz Raja was mightily impressed with Gill's battting in the game against Punjab Kings, and expressed his agreement with the popular opinion that Gill could succeed Virat Kohli's as India's next top-batter across all formats.\n\n“He has so much potential, he has so much time. He looks so naturally beautiful when he plays. When he drives, there's a curve on the shot. He has a lot of time to play his strokes. It doesn't matter if he scores on the off side, on side, hook or pull, it's just so beautiful and neat-and-clean. Many predict that he could be the next best batsman after Virat Kohli. He has touch, class, and elegance like Rohit Sharma. And his temperament is quite strong,” Raja said on his official YouTube channel.\n\n“From Tests, ODIs, and T20Is as well, he has tormented the bowlers. When you see him, it seems the time has stopped. At such a young age, he already has records. Sky is the limit for him,” he further said.\n\nGill is currently fifth among the highest run-scorers in the ongoing edition with 183 runs to his name in four matches.\n\nSHARE THIS ARTICLE ON",
        "summary": "The Gujarat Titans secured a close win against Punjab Kings on Thursday night, securing their third win of the 2023 Indian Premier League season.\nTheir opener Shubman Gill was the star for GT with the bat, as he scored an important 67 off 49 deliveries, smashing seven fours and a six.\nIt doesn't matter if he scores on the off side, on side, hook or pull, it's just so beautiful and neat-and-clean.\nMany predict that he could be the next best batsman after Virat Kohli.\nGill is currently fifth among the highest run-scorers in the ongoing edition with 183 runs to his name in four matches.",
        "Sentiment": "Positive",
        "images": "https://www.hindustantimes.com/ht-img/img/2023/04/14/1600x900/Collage_Maker-14-Apr-2023-06-44-PM-1059_1681478100527_1681478108256_1681478108256.jpg",
        "Publish date": "2023-04-14 18:47:39+05:30",
        "Keywords": [
            "raja",
            "kohli",
            "balls",
            "enormous",
            "secured",
            "ramizs",
            "stopped",
            "predict",
            "win",
            "punjab",
            "batsman",
            "virat",
            "titans",
            "shubman",
            "ramiz",
            "remark",
            "best",
            "gill"
        ],
        "TextClassification": "Sports",
        "id": 6
    },
    {
        "Headline": "\"Sold Most Of My Cars\": Virat Kohli Opens Up About His \"Impulsive\" Purchases - NDTV",
        "Url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3Lm5kdHYuY29tL2ZlYXR1cmUvc29sZC1tb3N0LW9mLW15LWNhcnMtdmlyYXQta29obGktb3BlbnMtdXAtYWJvdXQtaGlzLWltcHVsc2l2ZS1wdXJjaGFzZXMtMzkwNDc3N9IBcmh0dHBzOi8vd3d3Lm5kdHYuY29tL2ZlYXR1cmUvc29sZC1tb3N0LW9mLW15LWNhcnMtdmlyYXQta29obGktb3BlbnMtdXAtYWJvdXQtaGlzLWltcHVsc2l2ZS1wdXJjaGFzZXMtMzkwNDc3Ny9hbXAvMQ?oc=5&hl=en-US&gl=US&ceid=US:en",
        "Article": "Virat Kohli said in a video posted on RCB's social media handles.\n\nCalling the 'impulsive buys', Royal Challengers Bangalore (RBC) star player Virat Kohli on Wednesday said he sold most of the cars that he purchased over the years.\n\n\"Most of the cars I used to own were impulsive buys, I ended up hardly driving or travelling in them as well. Beyond a point, I was like this is pointless, so I ended up selling most of them and now we only use what we absolutely need to, it's about being practical,\" said the Indian cricketer while speaking on RCB's YouTube channel during a recent photoshoot.\n\nWatch the video here:\n\nBehind the Scenes with Virat Kohli at RCB Team Photoshoot\n\n\n\nCurrent playlist, new tattoo, trump cards and more… Know more about the personal side of @imVKohli, on Bold Diaries.#PlayBold#ನಮ್ಮRCB#IPL2023pic.twitter.com/nCatZhgFAQ — Royal Challengers Bangalore (@RCBTweets) March 29, 2023\n\n\n\nIn the same interview, he also revealed his current playlist. \"Surprisingly, I have gone a little back in time and I have recently downloaded Arijit Singh's MTV Unplugged playlist. He did an MTV unplugged segment once with some of his best songs and that was like soft-rock, very chill kind of version. I loved those versions,\" Virat Kohli said in a video posted on Royal Challengers Bangalore's social media handles.\n\nHe also revealed two batters that he regards as the 'Greatest of All Time', saying that they changed the dynamics of cricket completely. \"I have always taken two names, Sachin Tendulkar and Sir Viv Richards are the GOATs of Cricket. Sachin is my hero. These two have revolutionized batting in their generation and completely change the dynamic of cricket. That is why I feel they are the two greatest.\"\n\nOn being asked what he would say if he shared a table with the retired tennis great Roger Federer and footballer Cristiano Ronaldo, Virat said that he would just listen to both of them talking.\n\n\"I would just keep quiet and listen to both of them. I do not have much to contribute to that conversation. It would be all about soaking everything in, listening to two of the greatest athletes in the history of sports,\" said Virat.\n\nRecalling the fun he used to have playing with trump cards as a kid, Virat said that it was one of his favourite things to play with his friends.\n\n\"We used to hunt for those cards. Lex Luger (former WWE wrestler), used to be ranked one. There was Giant Gonsalvez (WWE wrestler) as well. It was fun playing with those cards. I also had posters of sportspersons, especially cricketers,\" said Virat.\n\nRCB will start their Indian Premier League (IPL) 2023 season with a match against Mumbai Indians (MI) at their home arena, M Chinnaswamy Stadium, Bengaluru on April 2.",
        "summary": "Virat Kohli said in a video posted on RCB's social media handles.\nCalling the 'impulsive buys', Royal Challengers Bangalore (RBC) star player Virat Kohli on Wednesday said he sold most of the cars that he purchased over the years.\n\"Most of the cars I used to own were impulsive buys, I ended up hardly driving or travelling in them as well.\nI loved those versions,\" Virat Kohli said in a video posted on Royal Challengers Bangalore's social media handles.\nIt would be all about soaking everything in, listening to two of the greatest athletes in the history of sports,\" said Virat.",
        "Sentiment": "Positive",
        "images": "https://c.ndtvimg.com/2023-03/pjrm4rco_virat-kohli_625x300_24_March_23.jpg",
        "Publish date": "None",
        "Keywords": [
            "sold",
            "purchases",
            "kohli",
            "cards",
            "impulsive",
            "video",
            "opens",
            "wwe",
            "virat",
            "royal",
            "used",
            "cars",
            "playlist",
            "cricket",
            "challengers"
        ],
        "TextClassification": "Sports",
        "id": 7
    },
    {
        "Headline": "Shah Rukh Khan hugs Virat Kohli and teaches ‘Jhoome Jo Pathaan’ hook step, their bonding wins the interne - Indiatimes.com",
        "Url": "https://news.google.com/rss/articles/CBMixAFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9lbnRlcnRhaW5tZW50L2hpbmRpL2JvbGx5d29vZC9uZXdzL3NoYWgtcnVraC1raGFuLWh1Z3MtdmlyYXQta29obGktYW5kLXRlYWNoZXMtamhvb21lLWpvLXBhdGhhYW4taG9vay1zdGVwLXRoZWlyLWJvbmRpbmctd2lucy10aGUtaW50ZXJuZXQtd2F0Y2gvYXJ0aWNsZXNob3cvOTkzMjYwOTIuY21z0gHIAWh0dHBzOi8vbS50aW1lc29maW5kaWEuY29tL2VudGVydGFpbm1lbnQvaGluZGkvYm9sbHl3b29kL25ld3Mvc2hhaC1ydWtoLWtoYW4taHVncy12aXJhdC1rb2hsaS1hbmQtdGVhY2hlcy1qaG9vbWUtam8tcGF0aGFhbi1ob29rLXN0ZXAtdGhlaXItYm9uZGluZy13aW5zLXRoZS1pbnRlcm5ldC13YXRjaC9hbXBfYXJ0aWNsZXNob3cvOTkzMjYwOTIuY21z?oc=5&hl=en-US&gl=US&ceid=US:en",
        "Article": "Read Also\n\nEver since ‘Pathaan’ released, the ‘Jhoome Jo Pathaan’ fever was spread all over. While the song was played at every occasion, fans couldn’t stop emulating the hook step from the film. The euphoria had even reached the cricket field as Virat Kohli was trying to get the step.But it’s not done yet! Shah Rukh Khan was present at the IPL match of Kolkata Knight Riders (KKR) Vs Royal Challengers Bangalore ( RCB ) match yesterday. KKR had won the match and Shah Rukh was seen greeting all the team members. As soon as he saw Virat, he ran to give him a tight hug. He was then teaching Kohli the hook step of ‘Jhoome Jo Pathaan’. Their bonding and pictures together have won the internet.SRK was accompanied for the match by Suhana Khan and Shanaya Kapoor. On work front, the actor is currently shooting for ‘Jawan’. As per reports, the film is in its last leg of shooting and Shah Rukh was reportedly shooting with Sanjay Dutt in the last week of March. Deepika Padukone is also touted to do a cameo in the film. SRK will also be seen next in Rajkumar Hirani’s ‘Dunki’.",
        "summary": "Read AlsoEver since ‘Pathaan’ released, the ‘Jhoome Jo Pathaan’ fever was spread all over.\nWhile the song was played at every occasion, fans couldn’t stop emulating the hook step from the film.\nShah Rukh Khan was present at the IPL match of Kolkata Knight Riders (KKR) Vs Royal Challengers Bangalore ( RCB ) match yesterday.\nKKR had won the match and Shah Rukh was seen greeting all the team members.\nAs per reports, the film is in its last leg of shooting and Shah Rukh was reportedly shooting with Sanjay Dutt in the last week of March.",
        "Sentiment": "neutral",
        "images": "https://static.toiimg.com/thumb/msid-99326090,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-44222/99326090.jpg",
        "Publish date": "None",
        "Keywords": [
            "kohli",
            "won",
            "shooting",
            "seen",
            "khan",
            "film",
            "virat",
            "wins",
            "rukh",
            "watch",
            "pathaan",
            "match",
            "teaches",
            "shah",
            "step"
        ],
        "TextClassification": "Sports",
        "id": 8
    },
    {
        "Headline": "Rohit Sharma: 'Can't keep dwelling on' Jasprit Bumrah's absence - ESPNcricinfo",
        "Url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5lc3BuY3JpY2luZm8uY29tL3N0b3J5L2lwbC0yMDIzLXJvaGl0LXNoYXJtYS1yZWZsZWN0cy1vbi1qYXNwcml0LWJ1bXJhaC1ob2xlLXZpcmF0LWtvaGxpLWVsYXRlZC13aXRoLXJjYi1zdGFydC0xMzY2NTY40gGPAWh0dHBzOi8vd3d3LmVzcG5jcmljaW5mby5jb20vc3RvcnkvaXBsLTIwMjMtcm9oaXQtc2hhcm1hLXJlZmxlY3RzLW9uLWphc3ByaXQtYnVtcmFoLWhvbGUtdmlyYXQta29obGktZWxhdGVkLXdpdGgtcmNiLXN0YXJ0LTEzNjY1Njg_cGxhdGZvcm09YW1w?oc=5&hl=en-US&gl=US&ceid=US:en",
        "Article": "Mumbai can't dwell on that, Rohit insisted. \"For the past six to eight months, I am used to playing without Jasprit Bumrah [for India too],\" he said after the loss. \"Of course, this is a different set-up. Someone needs to put their hand up and come in to fill that place. We can't keep dwelling on it. You can try and control the things that are in your control and those that are not in your control, you can't do that. Injuries are not in your control.\n\n\"The other guys that we have are talented. It's just that they haven't played a lot of IPL. We need to give them the support.\"\n\nDefending 171, each of Mumbai's bowlers - save for experienced legspinner Piyush Chawla whose four overs went for only 26 - had an economy rate in excess of eight. Their 11.2 overs of fast bowling - which included the likes of Jofra Archer, Cameron Green and Jason Behrendorff - went at a rate of 11.29 runs per over and that more than nullified the control Chawla had. It meant Mumbai lost their opening match by eight wickets with a whopping 22 balls remaining.\n\nOn the night, it was not just their bowling that let five-time champions Mumbai down. They had crumbled to 48 for 4 in the ninth over after being asked to bat and could get past 170 only because of rookie Tilak Varma 's partnerships with Nehal Wadhera and Arshad Khan - both of whom were on T20 debuts. Varma added 50 with Wadhera for the fifth wicket before combining with Arshad to add an unbroken 48 in 17 balls, and in the process he stayed unbeaten on 84 off 46 balls. Rohit heaped praise on the youngster for \"showing courage and being brave\" in the middle.\n\n\"He is a very positive person, quite talented as well,\" Rohit said. \"Some of the shots he played, in the first game of the season, he showed a lot of courage. That is something we spoke of - we want to be brave and courageous in the middle. We didn't start well, and it was always a catching up game. Hats off to Tilak to get us to a competitive total.\n\n\"It was a good pitch to bat on. We didn't bat to even half of our potential and yet got to 170. Probably 30-40 runs more would have been ideal. We were struggling to play the catch-up game but Tilak was magnificent.\"\n\nKohli: 'Me and Faf got off to the perfect start' Mumbai had the momentum after a strong finish with the bat and would have been hopeful of ending their streak of starting an IPL season with a loss, one that has been going on since 2013. But Mumbai had the momentum after a strong finish with the bat and would have been hopeful of ending their streak of starting an IPL season with a loss, one that has been going on since 2013. But Virat Kohli and Faf du Plessis added 148 for the opening wicket to quash any hope Mumbai had of disappointing a sold-out Chinnaswamy Stadium. Later, Kohli said that the \"phenomenal win\" capped off a near-perfect homecoming for them.\n\n\"I thought with the new ball it [the pitch] was a bit tricky [to bat on],\" Kohli said. \"But because we took them [their bowlers] down with the new ball, that's where we shifted the momentum completely towards us. How they batted in the last two overs, it could have been tricky to walk out without intent. The way we both started nullified the intensity that they were going to bring onto the field.\n\nFaf du Plessis and Virat Kohli started strongly for Royal Challengers Bangalore • BCCI\n\n\"Me and Faf got off to the perfect start. We kept going, kept backing ourselves. Faf went first and then I joined later. So, it was a very comprehensive win and we wanted to win with balls to spare so that it could benefit our net run rate a little bit.\"\n\nDespite being part of the Royal Challengers squad, legspinner Karn Sharma did not get a game last season. On Sunday, though, he picked up a couple of crucial middle-order wickets to puncture Mumbai's recovery. After being hit for two sixes by Wadhera, Karn tossed another one up to have him hole out before getting one past hard-hitter Tim David to bowl him.\n\n\"When he got the left-hander out after getting hit for two sixes, that's brave bowling,\" Kohli said of Karn. \"That comes from a lot of repetition of bowling in the right spot. He's had a good domestic season. He was bowling so well for us last year, unfortunately he couldn't get a game. He was ready to play, even in the nets here he wasn't getting hit for sixes in the nets easily.",
        "summary": "\"For the past six to eight months, I am used to playing without Jasprit Bumrah [for India too],\" he said after the loss.\nYou can try and control the things that are in your control and those that are not in your control, you can't do that.\n\"I thought with the new ball it [the pitch] was a bit tricky [to bat on],\" Kohli said.\nDespite being part of the Royal Challengers squad, legspinner Karn Sharma did not get a game last season.\n\"When he got the left-hander out after getting hit for two sixes, that's brave bowling,\" Kohli said of Karn.",
        "Sentiment": "Positive",
        "images": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/357300/357323.6.jpg",
        "Publish date": "None",
        "Keywords": [
            "bumrahs",
            "kohli",
            "balls",
            "absence",
            "bat",
            "rohit",
            "cant",
            "sharma",
            "bowling",
            "season",
            "going",
            "faf",
            "jasprit",
            "mumbai",
            "dwelling",
            "control",
            "game"
        ],
        "TextClassification": "Sports",
        "id": 9
    },
    {
        "Headline": "'I couldn't even think of doing that stuff': Virat Kohli lauds Rinku Singh - Indiatimes.com",
        "Url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL20udGltZXNvZmluZGlhLmNvbS9zcG9ydHMvY3JpY2tldC9pcGwvdG9wLXN0b3JpZXMvaS1jb3VsZG50LWV2ZW4tdGhpbmstb2YtZG9pbmctdGhhdC1zdHVmZi12aXJhdC1rb2hsaS1sYXVkcy1yaW5rdS1zaW5naC9hcnRpY2xlc2hvdy85OTUxODE0Mi5jbXPSAZ0BaHR0cHM6Ly9tLnRpbWVzb2ZpbmRpYS5jb20vc3BvcnRzL2NyaWNrZXQvaXBsL3RvcC1zdG9yaWVzL2ktY291bGRudC1ldmVuLXRoaW5rLW9mLWRvaW5nLXRoYXQtc3R1ZmYtdmlyYXQta29obGktbGF1ZHMtcmlua3Utc2luZ2gvYW1wX2FydGljbGVzaG93Lzk5NTE4MTQyLmNtcw?oc=5&hl=en-US&gl=US&ceid=US:en",
        "Article": "NEW DELHI: What Kolkata Knight Riders batter Rinku Singh achieved will be remembered and talked about for years. The left-handed Rinku pulled off a magical heist as he hammered five successive sixes off Gujarat Titans ' Yash Dayal from the last five balls of KKR's run chase to hand his side a miraculous three-wicket win.Not even the world's best batters would have backed themselves to hit five consecutive sixes with their team requiring 28 from the last five balls. Rinku garnered praise from all quarters and he found a new admirer in none other than Virat Kohli , who said he could not even think of doing that stuff in such a situation.\"What the youngsters are doing today is amazing to see. Look at this IPL, I couldn't even think of doing stuff what these young guys are doing. Just the other night, Rinku Singh hits 5 Sixes in last 5 balls which is amazing & never happened something like that. Coming in an hitting five sixes in a row to win a match, I mean what level is this? So that transition is happening is great. It is great to see such youngsters coming up,\" Kohli told Indian cricketer Robin Uthappa on Jio Cinema.Kohli also talked about the strike rate in T20 cricket saying that the 'anchor role' in T20s is still important. Former Kiwi cricketer and commentator Simon Doull's recently criticised Kohli for his strike rate against Lucknow Super Giants in Bangalore.\"Yeah for sure (important anchor role). I completely agree with that, There are many people who because they have not been in that situation themselves, they look at the game differently. Suddenly when the power play is done, they will be like 'oh, they have started rotating the strike,\" Kohli said.\"I'm not thinking about strike rate. Oh my strike rate must be 160 plus or anything. I play T20 cricket for according to the situation. If situation demands I can play 230 strike rate and I can do this any day. I always play for my team & not for myself,\" he added.",
        "summary": "Rinku garnered praise from all quarters and he found a new admirer in none other than Virat Kohli , who said he could not even think of doing that stuff in such a situation.\nLook at this IPL, I couldn't even think of doing stuff what these young guys are doing.\nFormer Kiwi cricketer and commentator Simon Doull's recently criticised Kohli for his strike rate against Lucknow Super Giants in Bangalore.\nSuddenly when the power play is done, they will be like 'oh, they have started rotating the strike,\" Kohli said.\nIf situation demands I can play 230 strike rate and I can do this any day.",
        "Sentiment": "Positive",
        "images": "https://static.toiimg.com/thumb/msid-99518255,width-1070,height-580,imgsize-77978,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "Publish date": "None",
        "Keywords": [
            "sixes",
            "play",
            "kohli",
            "think",
            "doing",
            "balls",
            "rinku",
            "strike",
            "lauds",
            "virat",
            "couldnt",
            "rate",
            "situation",
            "youngsters",
            "singh",
            "stuff"
        ],
        "TextClassification": "Sports",
        "id": 10
    }
]